<?php

return [
    /*
    |--------------------------------------------------------------------------
    | URL RSS ленты новостей
    |--------------------------------------------------------------------------
    */
    'rss_news_feed' => env('PARSER_INDEX_URL', 'http://static.feed.rbc.ru/rbc/logical/footer/news.rss'),

    /*
    |--------------------------------------------------------------------------
    | Количество новостей для постраничной разбивки
    |--------------------------------------------------------------------------
    */
    'news_on_page' => env('PARSER_NEWS_ON_PAGE', 100),
];