<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Переодичность запуска парсера (в секундах)
    |--------------------------------------------------------------------------
    */
    'launch_interval' => env('PARSER_LAUNCH_INTERVAL', 60),

    /*
    |--------------------------------------------------------------------------
    | URL Стартовой RSS страницы новостей
    |--------------------------------------------------------------------------
    */
    'rss_url' => env('PARSER_RSS_URL', 'http://static.feed.rbc.ru/rbc/logical/footer/news.rss'),
];